benchmark/nks-randread-4k.txt
randread-test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.6
Starting 4 processes
Jobs: 4 (f=4): [r(4)][11.7%][r=7991KiB/s,w=0KiB/s][r=1997,w=0 IOPS][eta 00m:53s]
Jobs: 4 (f=4): [r(4)][21.7%][r=8004KiB/s,w=0KiB/s][r=2001,w=0 IOPS][eta 00m:47s]
Jobs: 4 (f=4): [r(4)][31.7%][r=8012KiB/s,w=0KiB/s][r=2003,w=0 IOPS][eta 00m:41s]
Jobs: 4 (f=4): [r(4)][41.7%][r=8000KiB/s,w=0KiB/s][r=2000,w=0 IOPS][eta 00m:35s]
Jobs: 4 (f=4): [r(4)][51.7%][r=8008KiB/s,w=0KiB/s][r=2002,w=0 IOPS][eta 00m:29s]
Jobs: 4 (f=4): [r(4)][61.7%][r=8000KiB/s,w=0KiB/s][r=2000,w=0 IOPS][eta 00m:23s]
Jobs: 4 (f=4): [r(4)][71.7%][r=8000KiB/s,w=0KiB/s][r=2000,w=0 IOPS][eta 00m:17s]
Jobs: 4 (f=4): [r(4)][81.7%][r=8004KiB/s,w=0KiB/s][r=2001,w=0 IOPS][eta 00m:11s]
Jobs: 4 (f=4): [r(4)][91.7%][r=8000KiB/s,w=0KiB/s][r=2000,w=0 IOPS][eta 00m:05s]
Jobs: 4 (f=4): [r(4)][100.0%][r=8008KiB/s,w=0KiB/s][r=2002,w=0 IOPS][eta 00m:00s]
randread-test: (groupid=0, jobs=4): err= 0: pid=53: Mon Jul 27 13:35:08 2026
   read: IOPS=2007, BW=8029KiB/s (8222kB/s)(471MiB/60064msec)
    slat (usec): min=2, max=4918, avg=15.74, stdev=21.08
    clat (nsec): min=834, max=127288k, avg=63737313.61, stdev=4092695.33
     lat (usec): min=3, max=127299, avg=63753.32, stdev=4092.72
    clat percentiles (msec):
     |  1.00th=[   63],  5.00th=[   64], 10.00th=[   64], 20.00th=[   64],
     | 30.00th=[   64], 40.00th=[   64], 50.00th=[   65], 60.00th=[   65],
     | 70.00th=[   65], 80.00th=[   65], 90.00th=[   65], 95.00th=[   65],
     | 99.00th=[   65], 99.50th=[   66], 99.90th=[   72], 99.95th=[   80],
     | 99.99th=[  117]
   bw (  KiB/s): min= 1848, max= 3120, per=25.00%, avg=2006.97, stdev=92.34, samples=480
   iops        : min=  462, max=  780, avg=501.71, stdev=23.08, samples=480
  lat (nsec)   : 1000=0.07%
  lat (usec)   : 2=0.08%, 10=0.02%, 20=0.01%, 50=0.01%
  lat (msec)   : 2=0.04%, 4=0.12%, 10=0.03%, 20=0.02%, 50=0.05%
  lat (msec)   : 100=99.53%, 250=0.02%
  cpu          : usr=0.33%, sys=1.08%, ctx=113598, majf=0, minf=165
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=120563,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=8029KiB/s (8222kB/s), 8029KiB/s-8029KiB/s (8222kB/s-8222kB/s), io=471MiB (494MB), run=60064-60064msec

Disk stats (read/write):
  vdc: ios=119982/3, merge=0/1, ticks=7658966/6, in_queue=7658973, util=99.90%