benchmark/nks-seqwrite-1m.txt
seqwrite-test: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
fio-3.6
Starting 1 process
Jobs: 1 (f=1): [W(1)][11.7%][r=0KiB/s,w=31.0MiB/s][r=0,w=31 IOPS][eta 00m:53s]
Jobs: 1 (f=1): [W(1)][21.7%][r=0KiB/s,w=32.0MiB/s][r=0,w=32 IOPS][eta 00m:47s]
Jobs: 1 (f=1): [W(1)][31.7%][r=0KiB/s,w=32.0MiB/s][r=0,w=32 IOPS][eta 00m:41s]
Jobs: 1 (f=1): [W(1)][41.7%][r=0KiB/s,w=64.0MiB/s][r=0,w=64 IOPS][eta 00m:35s]
Jobs: 1 (f=1): [W(1)][52.5%][r=0KiB/s,w=64.0MiB/s][r=0,w=64 IOPS][eta 00m:28s]
Jobs: 1 (f=1): [W(1)][62.7%][r=0KiB/s,w=64.1MiB/s][r=0,w=64 IOPS][eta 00m:22s]
Jobs: 1 (f=1): [W(1)][71.7%][r=0KiB/s,w=64.1MiB/s][r=0,w=64 IOPS][eta 00m:17s]
Jobs: 1 (f=1): [W(1)][81.7%][r=0KiB/s,w=65.0MiB/s][r=0,w=65 IOPS][eta 00m:11s]
Jobs: 1 (f=1): [W(1)][91.7%][r=0KiB/s,w=64.0MiB/s][r=0,w=64 IOPS][eta 00m:05s]
Jobs: 1 (f=1): [W(1)][100.0%][r=0KiB/s,w=64.1MiB/s][r=0,w=64 IOPS][eta 00m:00s]
seqwrite-test: (groupid=0, jobs=1): err= 0: pid=72: Mon Jul 27 13:37:04 2026
  write: IOPS=53, BW=53.2MiB/s (55.8MB/s)(3207MiB/60242msec)
    slat (usec): min=56, max=498487, avg=1301.52, stdev=20085.18
    clat (msec): min=2, max=982, avg=298.59, stdev=121.76
     lat (msec): min=18, max=982, avg=299.89, stdev=120.68
    clat percentiles (msec):
     |  1.00th=[   24],  5.00th=[  234], 10.00th=[  249], 20.00th=[  249],
     | 30.00th=[  251], 40.00th=[  251], 50.00th=[  251], 60.00th=[  251],
     | 70.00th=[  251], 80.00th=[  405], 90.00th=[  502], 95.00th=[  502],
     | 99.00th=[  684], 99.50th=[  827], 99.90th=[  953], 99.95th=[  986],
     | 99.99th=[  986]
   bw (  KiB/s): min=24576, max=65536, per=99.90%, avg=54458.09, stdev=15686.10, samples=120
   iops        : min=   24, max=   64, avg=53.17, stdev=15.32, samples=120
  lat (msec)   : 4=0.22%, 10=0.03%, 20=0.28%, 50=1.15%, 100=0.78%
  lat (msec)   : 250=49.30%, 500=40.63%, 750=6.86%, 1000=0.75%
  cpu          : usr=0.43%, sys=0.52%, ctx=3159, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=99.5%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,3207,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=53.2MiB/s (55.8MB/s), 53.2MiB/s-53.2MiB/s (55.8MB/s-55.8MB/s), io=3207MiB (3363MB), run=60242-60242msec

Disk stats (read/write):
  vdc: ios=0/7741, merge=0/664, ticks=0/2449755, in_queue=2449759, util=100.00%